{
    "Activity":"Серверный процесс простаивает. Это состояние показывает, что процесс ожидает активности в основном цикле обработки. В wait_event обозначается конкретное место ожидания;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-ACTIVITY-TABLE",
    "BufferPin":"Серверный процесс ожидает исключительного доступа к буферу данных. Ожидание закрепления буфера может растягиваться, если другой процесс удерживает открытый курсор, который до этого читал данные из целевого буфера.\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-BUFFERPIN-TABLE",
    "Client":"Серверный процесс ожидает в сокете некоторую активность пользовательского приложения. То есть сервер ждёт, что произойдёт какое-то событие, не зависящее от его внутренних процессов. В wait_event обозначается конкретное место ожидания;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-CLIENT-TABLE",
    "Extension":"Серверный процесс ожидает условия, возникающего в модуле расширения.\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-EXTENSION-TABLE",
    "IO":"Серверный процесс ожидает завершения операции ввода/вывода. В wait_event обозначается конкретное место ожидания;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-IO-TABL",
    "IPC":"Серверный процесс ожидает взаимодействия с другим процессом. В wait_event обозначается конкретное место ожидания;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-IPC-TABLE",
    "Lock":"Серверный процесс ожидает тяжёлую блокировку. Тяжёлые блокировки, также называемые блокировками менеджера блокировок или просто блокировками, в основном защищают объекты уровня SQL, такие как таблицы. Однако они также применяются для взаимоисключающего выполнения некоторых внутренних операций, например, расширения отношений. Тип ожидаемой блокировки показывается в wait_event;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-LOCK-TABLE",
    "LWLock":"Серверный процесс ожидает лёгкую блокировку. В большинстве своём такие блокировки защищают определённые структуры данных в общей памяти. В wait_event будет содержаться имя, отражающее цель получения лёгкой блокировки. (Некоторые блокировки имеют особые имена; другие объединяются в группы блокировок с похожим предназначением.)\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-LWLOCK-TABLE",
    "Timeout":"Серверный процесс ожидает истечения определённого времени. В wait_event обозначается конкретное место ожидания;\nhttps://postgrespro.ru/docs/postgresql/14/monitoring-stats#WAIT-EVENT-TIMEOUT-TABLE"
}